package com.chinasofti.service;
import com.chinasofti.model.Concert;
public class CcService {
	public String select(Concert cc) {
		String rs=null;
		switch (cc.getConcert_id()) {
		case "1":
			rs="{'cmd':'202','code':'0','cid':'1','call':'010-58591188','mapx':'116.33332258227847','mapy':'39.92314568402951','price':'100,180,280,380,580,699','desc':'邓丽君-华语歌坛上，是一个传奇。她的歌有一种让人忘记痛苦的甜蜜，她的笑容柔得让人窒息。邓丽君在中国流行音乐史上毋庸置疑的是承前启后、开宗立派的一代大师。此次演出主办方将以重述青春作为整场音乐会的主轴，并以\"美好青春\"、\"惆怅青春\"、\"挣扎青春\"、\"感恩青春\"四个单元进行呈现，每个单元都包括多首具有鲜明感情色彩的邓丽君歌曲，演唱会舞台效果经过精心设计，绚丽多彩，原汁原味，气势恢弘','list':[{'name':'鱼翅','image':'50001','oprice':'0','nprice':'0'},{'name':'头盘','image':'12','oprice':'0','nprice':'0'},{'name':'大豆苗塌豆腐','image':'13','oprice':'0','nprice':'0'}]}";		
			break;
        case "2":
        	rs="{'cmd':'202','code':'0','cid':'1','call':'010-58591188','mapx':'116.33332258227847','mapy':'39.92314568402951','price':'100,180,280,380,580,699','desc':'张惠妹最为人津津乐道的，除了持续的推出脍炙人口的歌曲外，就是她独一无二的舞台魅力，她的歌唱能量在经过15年的淬炼后，似乎还呈现更大的魅力，以一位出道15年歌手来说，依旧可以在作品和市场上引领风骚，这是属于张惠妹的传奇。选择在出道15周年开唱，张惠妹是希望为自己和歌迷再创下一个有意义的回忆，这次的演唱会初步估计还没开唱制作费已经超过2500万人民币，因为张惠妹说：虽然我唱的都是最经典的歌，但一定要给大家最新最强烈的视觉','list':[{'name':'鱼翅','image':'50002','oprice':'0','nprice':'0'},{'name':'头盘','image':'12','oprice':'0','nprice':'0'},{'name':'大豆苗塌豆腐','image':'13','oprice':'0','nprice':'0'}]}";
			break;
        case "3":
            rs="{'cmd':'202','code':'0','cid':'3','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'2000年，以一首《勇气》让梁静茹红遍大中华地区，从此成为\"K歌天后\"，梁静茹的音乐以抒情淡雅类为主，同时包含轻快、摇滚等多种元素，她的声音温暖而磁性，有种非凡的力量，可以为人们心灵疗伤，可以在平凡中直指人心，直指你爱的世界，她也是当这无愧的\"亚洲情歌天后\"，对她而言，她是在用她的心和内涵去唱歌，能够用音乐真正跟所有的歌迷交流，分享才是身为一个歌手最大的幸福，就像她歌里面表达的那样，只有了解自己，热爱生活，珍爱身边的每一个人，才能发现使人生变得美丽的神奇秘诀！让我们一起体会静茹歌声中的超然，感受静茹歌声中的积极和快乐！','list':[{'name':'拿铁','image':'50003','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;			
        case "4":
        	rs="{'cmd':'202','code':'0','cid':'4','call':'010-88438044','mapx':'116.27940164152528','mapy':'39.95312751211249','price':'100,180,280,380,580,699','desc':'他一直在写情歌，动人的，平实的情歌，少有那么激昂的旋律和炽烈的歌词，而是《勇气》里，爱情开始时的胆怯到坚定，他曾说他唱歌的时候脸上是没有表情的，因为感情都渲染在声音里，熟悉的嗓音，静静地唱，不管晴天还是雨天，不管孤单还是相恋，不必怀疑，他的坚持，就是这个飞速变化着的世界里执着的守候，那是永远的邻家男孩，伴我们走过成长如蜕的岁月。在盛夏的光年里，让我们一起聆听光良的声音，穿过青葱岁月，点亮万顷心田','list':[{'name':'红烧肉','image':'50004','oprice':'0','nprice':'0'},{'name':'茶香鸡','image':'42','oprice':'0','nprice':'0'},{'name':'绿茶饼','image':'43','oprice':'0','nprice':'0'}]}";
			break;
		}													
			System.out.println(rs);							
		return rs;		
	}
}
