package com.chinasofti.service;
import com.chinasofti.model.Music;
public class McService {
	public String select(Music mc) {
		String rs=null;
		switch (mc.getMusicid()) {
		case "1":
			rs="{'cmd':'502','code':'0','mid':'1','call':'010-58591188','mapx':'116.33332258227847','mapy':'39.92314568402951','price':'100,180,280,380,580,699','desc':'《天空之城》中的爱尔兰民谣；天真、充满童趣的《龙猫》音乐；《小魔女宅急便》中糅合吹管乐与美国乡村音乐的民谣风格；极具日本传统音乐的《幽灵公主》；音乐色彩斑斓又不失大和民族的特色的《千与千寻》……经过交响乐团的演绎，弥散着时代的空灵与神秘。精彩的电影画面让你重温一个个曲折的故事，震撼心灵的优美音乐把你的思绪带入一个浪漫且充满梦幻色彩的童话世界。','list':[{'name':'鱼翅','image':'50001','oprice':'0','nprice':'0'},{'name':'头盘','image':'12','oprice':'0','nprice':'0'},{'name':'大豆苗塌豆腐','image':'13','oprice':'0','nprice':'0'}]}";		
			break;
        case "2":
        	rs="{'cmd':'502','code':'0','mid':'1','call':'010-58591188','mapx':'116.33332258227847','mapy':'39.92314568402951','price':'100,180,280,380,580,699','desc':'中国爱乐乐团在中山音乐堂由指挥家菲利普·昂特勒蒙、钢琴家李坚联袂，将为音乐听众献上一台精彩的勃拉姆斯专场音乐会，演奏了勃拉姆斯的学院节日序曲、第二钢琴协奏曲和第二交响曲。这是春节前乐季计划里的最后一场音乐。','list':[{'name':'鱼翅','image':'50002','oprice':'0','nprice':'0'},{'name':'头盘','image':'12','oprice':'0','nprice':'0'},{'name':'大豆苗塌豆腐','image':'13','oprice':'0','nprice':'0'}]}";
			break;
        case "3":
            rs="{'cmd':'502','code':'0','mid':'3','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'东方民乐团是由原中国东方歌舞团与原中国歌舞团的民乐队组建而成，具有五十多年的光辉历程，足迹遍及五大洲八十多个国家，接待过七十多位国家元首，能够演奏和演唱世界各地不同地区、不同风格的乐曲和歌曲。由于其特殊的历史背景和所演奏乐器与演唱形式的不可重复性使乐团形成了自己独特的艺术风格！乐团的任务是向国内的观众介绍世界各地、各民族风情的声器乐作品；向国外的观众介绍中国优秀的传统与现代音乐文化，作为音乐文化的使者发挥窗口、纽带与桥梁的作用！乐团的宗旨是让观众：不出剧院，走遍全球！','list':[{'name':'拿铁','image':'50003','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;			
        case "4":
        	rs="{'cmd':'502','code':'0','mid':'4','call':'010-88438044','mapx':'116.27940164152528','mapy':'39.95312751211249','price':'100,180,280,380,580,699','desc':'圣马可儿童合唱团(LesPetitsChanteursdeSaint-Marc)由尼古拉斯.博(NicoiasPorte)成立于1986年。合唱团成员都来自同一所学校，年龄届乎于10至15岁。这合唱团在法国里昂已经享誉达20年之久。2003年，该团被电影《放牛班的春天》(LesChoristes)的导演发掘，在影片中担当演出。2004年全世界放映，获得空前成功，全球接近一千万人曾观赏这部电影，而其原声大碟更卖出超过两百万张。圣马可童声合唱团的成功，不仅在他们出色的音乐和受到全世界的欣赏，更在于他们从一所普通学校的合唱团，一跃成为世界知名合唱团。','list':[{'name':'红烧肉','image':'50004','oprice':'0','nprice':'0'},{'name':'茶香鸡','image':'42','oprice':'0','nprice':'0'},{'name':'绿茶饼','image':'43','oprice':'0','nprice':'0'}]}";
			break;
		}													
			System.out.println(rs);							
		return rs;		
	}
}
