package com.chinasofti.service;
import com.chinasofti.model.Movie;
public class MvService {
	public String select(Movie mv) {
		String rs=null;		
		switch(mv.getMovieid()) {
		case "1":
			rs="{'cmd':'102','code':'0','mid':'1','call':'4006103721','mapx':'116.382591247559','mapy':'39.9061164855957','tlong':'95分钟','price':'100,180,280,380,580,699','desc':'强尼·布雷兹以前是个著名的摩托车手，专门做高难度的摩托车表演。后来他父亲生病了，强尼·布雷兹做了一件非常疯狂的事－－他和魔鬼做了交易，把灵魂卖给了魔鬼，以求换得父亲的生命。但是父亲还是死了，而布雷兹的灵魂却归了魔鬼...'}";		
			break;
        case "2":
        	rs="{'cmd':'102','code':'0','mid':'2','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','tlong':'135分钟','price':'100,180,280,380,580,699','desc':'妖狐小唯（周迅 饰）因救人违反妖界规则，被封冻在寒冰地狱中度过了五百年，痛苦不堪。在命运面前，逃离冰窟的小唯只有两个选择：要么被寒冰地狱的冰舌抓回去，要么获得一颗“主动奉献”的人心真正成人。小唯四处寻找目标，直到偶遇逃婚并因一次意外被毁容的靖公主（赵薇 饰）。小唯很快发现，公主有一颗与众不同的心，她把变成人的理想全部寄托在公主身上','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;
        case "3":
            rs="{'cmd':'102','code':'0','mid':'3','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','tlong':'120分钟','price':'100,180,280,380,580,699','desc':'性情急躁、头发乱糟糟的玛瑞达（Merida）尽管身为公主，但却更喜欢当一名弓箭手。这与她妈妈的意愿发生了冲突，于是玛瑞达做出了一个鲁莽的决定，未曾料到给父亲的王国、母亲的生命造成了危险。玛瑞达和无法预料的自然之力、黑暗魔法、古代诅咒抗争着，要让一切重回正轨……','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;			
        case "4":
        	rs="{'cmd':'102','code':'0','mid':'4','call':'010-88438044','mapx':'116.27940164152528','mapy':'39.95312751211249','tlong':'130分钟','price':'100,180,280,380,580,699','desc':'一场吊桥倒塌事件，一个男子的预感救了一群参加公司组织的野外拓展活动的同事，令他们遭遇了悬索桥坍塌的意外灾难侥幸逃生。但是这群倒霉蛋们注定无法顺利逃生，在与时间的可怕赛跑中，他们发了疯一样寻求逃脱死神的魔掌。据悉片中还将包括激光眼睛手术的场景，同第四部一样，本片也会采用3D技术直接拍摄，所以肯定十分刺激!','list':[{'name':'红烧肉','image':'41','oprice':'0','nprice':'0'},{'name':'茶香鸡','image':'42','oprice':'0','nprice':'0'},{'name':'绿茶饼','image':'43','oprice':'0','nprice':'0'}]}";
			break;
		}													
			System.out.println(rs);							
		return rs;		
	}
}
