package com.chinasofti.service;
import com.chinasofti.model.PekingOpera;
public class PkoService {
	public String select(PekingOpera pko) {
		String rs=null;		
		switch(pko.getPekingopera_id()) {
		case "1":
			rs="{'cmd':'602','code':'0','pid':'1','call':'4006103721','mapx':'116.382591247559','mapy':'39.9061164855957','price':'100,180,280,380,580,699','desc':'佘赛花，封号太君。生于后唐清泰年间（934年），佘太君生长在一个爱国名将的家庭里，自幼受其父兄武略的影响，青年时候就成为一名性机敏、善骑射，文武双全的女将。她少年时便与普通的大家闺秀不同，她研习兵法，颇通将略，把戍边御侵、保卫疆域、守护中原民众为己任，协助父兄练兵把关，已具备巾帼英雄的气度...'}";		
			break;
        case "2":
        	rs="{'cmd':'602','code':'0','pid':'2','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'历史剧。是1961年田汉根据碗碗腔《女巡按》改写的，中国京剧院杜近芳首演。此剧为杜近芳代表作，表演清新明快，柔美大方，融青衣、小生与一体，赏心悦目，光彩照人。 此剧亦是中国京剧院（即中国国家剧院）的看家戏...','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;
        case "3":
            rs="{'cmd':'602','code':'0','pid':'3','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'《金玉奴》是戏曲传统剧目，亦名《棒打薄情郎》、《鸿鸾禧》，取材于《古今小说》第二十七卷《金玉奴棒打薄情郎》,宋朝时，杭州城金老大就一个女儿，名叫玉奴，生得十分美貌。金老大从小教女儿读书识字，金玉奴到十五岁时已诗赋俱通，调筝弄管，事事伶俐...','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;			
        case "4":
        	rs="{'cmd':'602','code':'0','pid':'4','call':'010-88438044','mapx':'116.27940164152528','mapy':'39.95312751211249','price':'100,180,280,380,580,699','desc':'伍子胥是楚国人，姓伍，名员，字子胥。  伍子胥,楚平王听信谗言，计杀了伍子胥的父亲和兄长，伍子胥携楚太子建之子胜逃奔他国，被楚兵一路追杀。 伍子胥二人碾转到了离昭关六十里路的一座小山下，从这里出了昭关，便是大河，径直通吴国的水路了。然而，此关被右司马远越领兵把守，很难过关...','list':[{'name':'红烧肉','image':'41','oprice':'0','nprice':'0'},{'name':'茶香鸡','image':'42','oprice':'0','nprice':'0'},{'name':'绿茶饼','image':'43','oprice':'0','nprice':'0'}]}";
			break;
		}													
			System.out.println(rs);							
		return rs;		
	}
}
