package com.chinasofti.service;
import com.chinasofti.model.Play;
public class PyService {
	public String select(Play py) {
		String rs=null;		
		switch(py.getPlay_id()) {
		case "1":
			rs="{'cmd':'702','code':'0','pid':'1','call':'4006103721','mapx':'116.382591247559','mapy':'39.9061164855957','image':'70001','price':'100,180,280,380,580,699','desc':'陈道明、何冰话剧《喜剧的忧伤》是人艺青年导演徐昂根据日本编剧三谷幸喜的作品《笑的大学》改编的作品，全剧讲的是一个剧团编剧和剧本审查官之间发生的喜剧故事。在中国版中，故事的时代背景则改成了上世纪四十年代的中国。人艺对《笑的大学》进行本土化的改编后，定名为《喜剧的忧伤》，在剧中陈道明将饰演一个文化机构的审查官，与何冰饰演的编剧进行一场延续多日的争论。该剧为“对子戏”，也就是双人话剧，难度系数很高。两人将在舞台上上演一场对手戏'}";		
			break;
        case "2":
        	rs="{'cmd':'702','code':'0','pid':'2','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'《活着》是\"中国大陆先锋派小说代表人物\"余华的新现实主义力作。作品以一位田间老者对人生的回忆为线索，深刻地展现了世事弄人的时代与悲欢离合的命运。导演孟京辉与作家余华在该作品的思想、艺术方面进行了多次深入探讨，二人思想高度契合并达成共识，欲以一种沉静平和的表达方式诉说人的尊严以及对生命的尊重。本剧由中国国家话剧院著名先锋戏剧导演孟京辉执导，著名实力派演员黄渤、袁泉领衔主演。','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;
        case "3":
            rs="{'cmd':'702','code':'0','pid':'3','call':'010-63333329','mapx':'116.42126641534423','mapy':'39.89312789999999','price':'100,180,280,380,580,699','desc':'1954年，北京人艺极为成功地上演了这部作品，由郑榕、朱琳、于是之、吕恩、苏民、胡宗温等人演绎的剧中人物命运，深深打动感染着观众。多少年来，《雷雨》在北京人艺的舞台上经久不衰，并锻炼了一代代的年轻演员。北京人艺目前上演的以龚丽君、杨立新、王斑为主演的这一版《雷雨》，则集中体现了剧院第三代、第四代演员的优秀表演。','list':[{'name':'拿铁','image':'31','oprice':'0','nprice':'0'},{'name':'草莓松饼','image':'32','oprice':'0','nprice':'0'},{'name':'金枪鱼三明治','image':'33','oprice':'0','nprice':'0'}]}";
			break;			
        case "4":
        	rs="{'cmd':'702','code':'0','pid':'4','call':'010-88438044','mapx':'116.27940164152528','mapy':'39.95312751211249','price':'100,180,280,380,580,699','desc':'纪念我每一个倒在路上的朋友。','list':[{'name':'红烧肉','image':'41','oprice':'0','nprice':'0'},{'name':'茶香鸡','image':'42','oprice':'0','nprice':'0'},{'name':'绿茶饼','image':'43','oprice':'0','nprice':'0'}]}";
			break;
		}													
			System.out.println(rs);							
		return rs;		
	}
}
